# CannotMirrorInView Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..EditingFailures..::..CannotMirrorInView Property
BuiltInFailures..::..EditingFailures Class See Also
---
Must specify Work Plane to mirror in a 3d View.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotMirrorInView { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotMirrorInView As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotMirrorInView {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..EditingFailures Class
Autodesk.Revit.DB Namespace